# -*- coding: UTF-8 -*-
from enum import Enum


class BuildingType(Enum):
    木屋 = 0
    居民楼 = 1
    钢结构房 = 2
    平房 = 3
    小型公寓 = 4
    人才公寓 = 5
    花园洋房 = 6
    中式小楼 = 7
    空中别墅 = 8
    复兴公馆 = 9
    便利店 = 10
    五金店 = 11
    服装店 = 12
    菜市场 = 13
    学校 = 14
    图书城 = 15
    商贸中心 = 16
    加油站 = 17
    民食斋 = 18
    媒体之声 = 19
    木材厂 = 20
    食品厂 = 21
    造纸厂 = 22
    水厂 = 23
    电厂 = 24
    钢铁厂 = 25
    纺织厂 = 26
    零件厂 = 27
    企鹅机械 = 28
    人民石油 = 29
    梦想公寓 = 30
    追梦快递 = 31
    游泳馆 = 32
    强国煤业 = 33
